import datetime

def printTimeStamp(name):
    print('Автор програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp('Пікула. Погорілий')

a = float(input('Введіть магнітуду: '))
if a >= 0 and a < 2.0:
    print("""
Мікро

Мікроземлетруси, не відчуваються.
""")
elif a >= 2.0 and a < 3.0:
    print("""
Дуже слабкі

Як правило не відчуваються, але реєструються.
""")
elif a >= 3.0 and a < 4.0:
    print("""
Слабкі

Часто відчуваються, дуже рідко завдають шкоди.
""")
elif a >= 4.0 and a < 5.0:
    print("""
Легкі

Відчутне тремтіння речей всередині будинків, значна шкода малоймовірна.
""")
elif a >= 5.0 and a < 6.0:
    print("""
Помірні

Може завдати значної шкоди старим та погано сконструйованим будівлям на незначній території. Щонайбільше, незначні пошкодження добре спроектованим будівлям.
""")
elif a >= 6.0 and a < 7.0:
    print("""
Сильні

Може спричинити руйнацію на території до 150 км довжиною/шириною в населених регіонах.
""")
elif a >= 7.0 and a < 8.0:
    print("""
Дуже сильні

Значна руйнація на значній території.
""")
elif a >= 8.0 and a < 9.0:
    print("""
Великі

Серйозна руйнація на територіях довжиною/шириною в сотні кілометрів.
""")
elif a >= 9.0:
    print("""
Рідкісно великі

Аніме.
""")
else:
    print('Помилка')
